In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('/content/train_MpHjUjU.csv')
test = pd.read_csv('/content/test_hXY9mYw.csv')

In [6]:
df.head(10)

       MMM-YY  Emp_ID  Age  ... Designation Total Business Value Quarterly Rating
0  2016-01-01       1   28  ...           1              2381060                2
1  2016-02-01       1   28  ...           1              -665480                2
2  2016-03-01       1   28  ...           1                    0                2
3  2017-11-01       2   31  ...           2                    0                1
4  2017-12-01       2   31  ...           2                    0                1
5  2016-12-01       4   43  ...           2                    0                1
6  2017-01-01       4   43  ...           2                    0                1
7  2017-02-01       4   43  ...           2                    0                1
8  2017-03-01       4   43  ...           2               350000                1
9  2017-04-01       4   43  ...           2                    0                1

[10 rows x 13 columns]

In [ ]:
df.describe()

             Emp_ID           Age  ...  Total Business Value  Quarterly Rating
count  19104.000000  19104.000000  ...          1.910400e+04      19104.000000
mean    1415.591133     34.650283  ...          5.716621e+05          2.008899
std      810.705321      6.264471  ...          1.128312e+06          1.009832
min        1.000000     21.000000  ...         -6.000000e+06          1.000000
25%      710.000000     30.000000  ...          0.000000e+00          1.000000
50%     1417.000000     34.000000  ...          2.500000e+05          2.000000
75%     2137.000000     39.000000  ...          6.997000e+05          3.000000
max     2788.000000     58.000000  ...          3.374772e+07          4.000000

[8 rows x 10 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19104 entries, 0 to 19103
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   MMM-YY                19104 non-null  object
 1   Emp_ID                19104 non-null  int64
 2   Age                   19104 non-null  int64
 3   Gender                19104 non-null  object
 4   City                  19104 non-null  object
 5   Education_Level       19104 non-null  object
 6   Salary                19104 non-null  int64
 7   Dateofjoining         19104 non-null  object
 8   LastWorkingDate       1616 non-null   object
 9   Joining Designation   19104 non-null  int64
 10  Designation           19104 non-null  int64
 11  Total Business Value  19104 non-null  int64
 12  Quarterly Rating      19104 non-null  int64
dtypes: int64(7), object(6)
memory usage: 1.9+ MB

In [ ]:
df.isna().sum()

MMM-YY                      0
Emp_ID                      0
Age                         0
Gender                      0
City                        0
Education_Level             0
Salary                      0
Dateofjoining               0
LastWorkingDate         17488
Joining Designation         0
Designation                 0
Total Business Value        0
Quarterly Rating            0
dtype: int64

# **Data Preprocessing**

In [5]:
df_null = df[df['LastWorkingDate'].isnull() == True] 
df_not_null = df[df['LastWorkingDate'].isnull() == False]

In [7]:
df_not_null.LastWorkingDate = 1

/usr/local/lib/python3.7/dist-packages/pandas/core/generic.py:5170: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [8]:
not_null_emps = list(df_not_null.Emp_ID.unique())

In [9]:
df_null['LastWorkingDate']=df_null['Emp_ID'].apply(lambda x: 1 if x in not_null_emps else 0)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [10]:
df1 = df_null.append(df_not_null).copy()

In [11]:
df = df1.copy()

In [12]:
df.replace({'Male':0,'Female':1},inplace=True)

In [13]:
df.City = df.City.astype('category').cat.codes
df.Education_Level = df.Education_Level.astype('category').cat.codes

In [ ]:
df.columns

Index(['MMM-YY', 'Emp_ID', 'Age', 'Gender', 'City', 'Education_Level',
       'Salary', 'Dateofjoining', 'LastWorkingDate', 'Joining Designation',
       'Designation', 'Total Business Value', 'Quarterly Rating'],
      dtype='object')

In [18]:
df1 = df[['Emp_ID', 'Age', 'Gender', 'City', 'Education_Level',
       'Salary', 'Joining Designation',
       'Designation', 'Total Business Value', 'Quarterly Rating','LastWorkingDate']]

In [19]:
#median
df1 = df1.groupby(by='Emp_ID')['Education_Level','Salary', 'Joining Designation','Designation', 'Total Business Value', 'Quarterly Rating','LastWorkingDate'].median()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.

In [ ]:
df1.LastWorkingDate.unique()

array([1., 0.])

In [ ]:
df1

        Education_Level   Salary  ...  Quarterly Rating  LastWorkingDate
Emp_ID                            ...
1                     2  57387.0  ...               2.0              1.0
2                     2  67016.0  ...               1.0              0.0
4                     2  65603.0  ...               1.0              1.0
5                     1  46368.0  ...               1.0              1.0
6                     0  78728.0  ...               2.0              0.0
...                 ...      ...  ...               ...              ...
2784                  1  82815.0  ...               3.0              0.0
2785                  1  12105.0  ...               1.0              1.0
2786                  1  35370.0  ...               2.0              1.0
2787                  2  69498.0  ...               1.5              1.0
2788                  2  70254.0  ...               2.0              0.0

[2381 rows x 7 columns]

# **Feature Scaling**

In [20]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
df2 = sc.fit_transform(df1.values)

In [ ]:
df1.LastWorkingDate.value_counts()

1.0    1616
0.0     765
Name: LastWorkingDate, dtype: int64

# **Model Build**

In [21]:
from sklearn.cluster import KMeans

In [22]:
km = KMeans(n_clusters=2,max_iter=300)
km.fit(df2)
df1['cluster'] = km.predict(df2)

In [ ]:
df1.cluster.value_counts()

1    1442
0     939
Name: cluster, dtype: int64

In [23]:
df1.reset_index(level=0, inplace=True)

In [24]:
test_X = pd.merge(test,df1,on='Emp_ID',how='inner')

In [25]:
test_X

     Emp_ID  Education_Level  ...  LastWorkingDate  cluster
0       394                2  ...              0.0        1
1       173                1  ...              0.0        1
2      1090                1  ...              0.0        1
3       840                1  ...              0.0        1
4       308                2  ...              0.0        1
..      ...              ...  ...              ...      ...
736    2134                1  ...              0.0        1
737    2255                1  ...              0.0        1
738     448                0  ...              0.0        1
739    1644                0  ...              0.0        1
740     624                0  ...              0.0        1

[741 rows x 9 columns]

In [ ]:
test_X.cluster.value_counts()

0    507
1    234
Name: cluster, dtype: int64

# **Submit**

In [ ]:
pd.read_csv('/content/sample_submission_znWiLZ4.csv')

     Emp_ID  Target
0       394       0
1       173       0
2      1090       0
3       840       0
4       308       0
..      ...     ...
736    2134       0
737    2255       0
738     448       0
739    1644       0
740     624       0

[741 rows x 2 columns]

In [ ]:
submit = pd.DataFrame(test_X.cluster.values,columns=['Target'])
submit['Emp_ID'] = test_X['Emp_ID']
submit = submit[['Emp_ID','Target']]

In [ ]:
submit

     Emp_ID  Target
0       394       1
1       173       1
2      1090       1
3       840       1
4       308       1
..      ...     ...
736    2134       1
737    2255       1
738     448       1
739    1644       1
740     624       1

[741 rows x 2 columns]

In [ ]:
submit.to_csv('submit_jobathon.csv', index=False)